# -*- coding: utf-8 -*-

# app_id
app_id = '302410'
# app_key
app_key = 'M5Eq7WthyuA+jD8U7t7NvwlckxQjHJ8o'
# usr_id
usr_id = '102210'
# usr_key
usr_key = '8juy1ZWWmrmIFytsKvl8u0rIHoOW4n0w'

# 斐斐打码返回错误码
fateadm_code = {
    "0": "请求正常响应",
    "-1": "服务器繁忙请稍后重试",
    "3000": "签名验证失败",
    "3001": "请求的参数不存在，请检查参数列表",
    "3002": "用户不存在",
    "3010": "服务器繁忙，请稍候重试",
    "3011": "图片数据异常，请检查图片格式",
    "3020": "充值卡不存在，请检查卡号码",
    "3021": "充值卡数据异常，请与客服联系",
    "3022": "充值卡金额异常，请与客服联系",
    "3023": "该充值卡已使用",
    "4000": "该订单已扣费",
    "4001": "该订单已退款",
    "4002": "扣费类型不存在",
    "4003": "账户余额不足，请及时充值",
    "4004": "请求失败",
    "4005": "订单号不存在或者已经过了可退款周期，无法进行退款"}