1、常用类型
图像类型ID	题分	类型描述
101	10	常用4位英文
4	10	4位数字

2、固定位数纯数字类型
图像类型ID	题分	类型描述
1	10	1位数字  4001
2	10	2位数字
3	10	3位数字
4	10	4位数字
5	11	5位数字
6	12	6位数字
7	15	7位数字
8	20	8位数字
9	30	9位数字
10	40	10位数字 4010

3、不固定位数纯数字类型
图像类型ID	题分	类型描述
11	10	1-2位不定长数字 4000
12	10	1-3位不定长数字 4000
13	10	1-4位不定长数字
14	11	1-5位不定长数字
15	12	1-6位不定长数字
16	15	1-7位不定长数字
17	20	1-8位不定长数字
18	30	1-9位不定长数字
19	40	1-10位不定长数字 4000

4、固定位数纯英文字母类型
图像类型ID	题分	类型描述
20	4	1位英文字符 3001
21	10	2位英文字符
22	10	3位英文字符
23	10	4位英文字符
24	11	5位英文字符
25	12	6位英文字符
26	15	7位英文字符
27	20	8位英文字符
28	20	9位英文字符
29	20	10位英文字符
121	20	11位英文字符
122	20	12位英文字符
123	20	13位英文字符
124	20	14位英文字符
125	20	15位英文字符
126	20	16位英文字符
127	20	17位英文字符
128	20	18位英文字符
129	20	19位英文字符
130	20	20位英文字符 3020

5、不固定位数纯英文字母类型
图像类型ID	题分	类型描述
30	10	1-2位不定长字符 3000
31	10	1-3位不定长字符
32	10	1-4位不定长字符
33	11	1-5位不定长字符
34	12	1-6位不定长字符
35	15	1-7位不定长字符
36	20	1-8位不定长字符
37	30	1-9位不定长字符
38	40	1-10位不定长字符
111	42	1-11位不定长字符
112	44	1-12位不定长字符
113	46	1-13位不定长字符
114	48	1-14位不定长字符
115	50	1-15位不定长字符
116	52	1-16位不定长字符
117	54	1-17位不定长字符
118	56	1-18位不定长字符
119	58	1-19位不定长字符
120	60	1-20位不定长字符
281	60	1-20位不定长字符，输入斜体部分单词 3000

6、固定位数英文数据混杂类型
图像类型ID	题分	类型描述
39	10	1位数字英文混合  1001
40	10	2位数字英文混合
41	10	3位数字英文混合
42	11	4位数字英文混合
43	12	5位数字英文混合
44	13	6位数字英文混合
45	16	7位数字英文混合
46	21	8位数字英文混合
47	31	9位数字英文混合
48	41	10位数字英文混合
141	44	11位数字英文混合
142	46	12位数字英文混合
143	48	13位数字英文混合
144	50	14位数字英文混合
145	52	15位数字英文混合
146	54	16位数字英文混合
147	56	17位数字英文混合
148	58	18位数字英文混合
149	60	19位数字英文混合
150	62	20位数字英文混合 1020

7、不固定位数英文数据混杂类型
图像类型ID	题分	类型描述
50	10	1-2位不定长数字英文混合 1000
51	10	1-3位不定长数字英文混合
52	11	1-4位不定长数字英文混合
53	12	1-5位不定长数字英文混合
54	13	1-6位不定长数字英文混合
55	16	1-7位不定长数字英文混合
56	21	1-8位不定长数字英文混合
57	31	1-9位不定长数字英文混合
58	41	1-10位不定长数字英文混合
131	44	1-11位不定长数字英文混合
132	46	1-12位不定长数字英文混合
133	48	1-13位不定长数字英文混合
134	50	1-14位不定长数字英文混合
135	52	1-15位不定长数字英文混合
136	54	1-16位不定长数字英文混合
137	56	1-17位不定长数字英文混合
138	58	1-18位不定长数字英文混合
139	60	1-19位不定长数字英文混合 1000

8、固定位数汉字类型
图像类型ID	题分	类型描述
59	10	1位中文 2001
60	15	2位中文
61	25	3位中文
62	40	4位中文
63	45	5位中文
64	50	6位中文
65	55	7位中文
66	65	8位中文
67	75	9位中文
68	85	10位中文
259	95	11位中文
260	105	12位中文
261	115	13位中文
262	125	14位中文
263	135	15位中文
264	145	16位中文
265	155	17位中文
266	165	18位中文
267	175	19位中文
268	185	20位中文 2020

9、不固定位数汉字类型
图像类型ID	题分	类型描述
69	15	1-2位不定长中文 2000
70	25	1-3位不定长中文
71	40	1-4位不定长中文
72	45	1-5位不定长中文
73	50	1-6位不定长中文
74	55	1-7位不定长中文
75	65	1-8位不定长中文
76	75	1-9位不定长中文
77	85	1-10位不定长中文
269	95	1-11位不定长中文
270	105	1-12位不定长中文
271	115	1-13位不定长中文
272	125	1-14位不定长中文
273	135	1-15位不定长中文
274	145	1-16位不定长中文
275	155	1-17位不定长中文
276	165	1-18位不定长中文
277	175	1-19位不定长中文
278	185	1-20位不定长中文 2000

10、固定位数纯英文或纯数字类型
图像类型ID	题分	类型描述
79	10	2位纯英文或纯数字  1002
80	10	3位纯英文或纯数字
81	10	4位纯英文或纯数字
82	11	5位纯英文或纯数字
83	12	6位纯英文或纯数字
84	15	7位纯英文或纯数字
85	20	8位纯英文或纯数字
86	30	9位纯英文或纯数字
87	40	10位纯英文或纯数字 1010

11、不固定位数纯英文或纯数字类型
图像类型ID	题分	类型描述
88	10	1-2位不定长纯英文或纯数字 1000
89	10	1-3位不定长纯英文或纯数字
90	10	1-4位不定长纯英文或纯数字
91	11	1-5位不定长纯英文或纯数字
92	12	1-6位不定长纯英文或纯数字
93	15	1-7位不定长纯英文或纯数字
94	20	1-8位不定长纯英文或纯数字
95	30	1-9位不定长纯英文或纯数字
96	40	1-10位不定长纯英文或纯数字 1000

12、选择题类型
图像类型ID	题分	类型描述
78	15	单选题-选匹配数字序号
98	10	单选题-有几个一样的字
99	15	单选题-某个字出现的位置
303	10	单选题-字符位置
100	15	单选题-找旋转方向不同的图
103	15	单选题-找正面向你的图
104	15	单选题-找不同性别的图
105	20	多选题-某个字出现的位置
106	15	计算题-加减法计算题
107	15	计算题-乘除法计算题
108	30	多选题-汉字按顺序9选4
109	40	四汉字或加减乘除
110	20	双选题-8个字中找相同字的序号
283	20	双选题-选出两个相同动物序号
151	15	单选题-ABCD
152	10	单选题-4组汉字，4选1
153	20	多选题-4列组图中选出方向正确的4幅图位置
155	15	单选题-选匹配序号，限1234或ABCD
156	20	多选题-选旋转方向，限12
157	15	单选题-6选1匹配数字序号，限123456
279	7	旋转方向，1-顺时针 2-逆时针，限[12]
280	20	6格计算题，顺序填写每格计算出的答案

13、鼠标坐标题类型
图像类型ID	题分	类型描述
285	10	鼠标坐标单选题.返回格式：x,y
286	12	鼠标坐标双选题.返回格式：x1,y1|x2,y2
287	15	鼠标坐标多选题.返回格式：x1,y1|x2,y2|x3,y3
300	20	鼠标坐标双选题-点击两个相同的动物.返回格式：x1,y1|x2,y2
301	12	鼠标坐标双选题-点击２个相同汉字.~返回格式：x1,y1|x2,y2
302	20	鼠标坐标双选题-按顺序点击4个汉字.~返回格式：x1,y1|x2,y2|x3,y3|x4,y4
308	30	鼠标坐标1-5选题-按顺序点击5个汉字.~返回格式：x1,y1|x2,y2|x3,y3|x4,y4|x5,y5
310	20	鼠标坐标1-5选题-选择提示物品的图案.~返回格式：x1,y1|x2,y2|x3,y3|x4,y4|x5,y5
311	25	鼠标坐标1-6选题.~返回格式：x1y1x2y2x3y3x4y4x5y5 每个值用3位表示无分隔符，如坐标88,133，则表示为088133

14、特殊类型
图像类型ID	题分	类型描述
200	40	不固定适用任意填空题，题分按实际输入长度计算，只是预扣40或60，多退少不补
154	20	知识问答题
140	62	1-20位不定长字符
